<a href="https://colab.research.google.com/github/2303A51256/Python_DS-B19/blob/main/PyDS_Lab_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [23]:
import pandas as pd
data = [10, 20, 30, 40, 50]
series = pd.Series(data)

print("Pandas Series: ")
print(series)

Pandas Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [24]:
data = [10, 20, 30, 40, 50]
index_labels = ['a', 'b', 'c', 'd', 'e']

series = pd.Series(data, index=index_labels)

print("Pandas Series with Custom Index: ")
print(series)

Pandas Series with Custom Index:
a    10
b    20
c    30
d    40
e    50
dtype: int64

In [25]:
data = {
    'Name' : ['Alice', 'Bob', 'Charlie', 'David'],
    'Age' : [25, 30, 35, 40],
    'City' : ['Hyderabad', 'Mumbai', 'Delhi', 'Bangalore']
}
df = pd.DataFrame(data)
print("DataFrame:")
print(df)

DataFrame:
      Name  Age       City
0    Alice   25  Hyderabad
1      Bob   30     Mumbai
2  Charlie   35      Delhi
3    David   40  Bangalore

In [26]:
# a) Accessing Data
#Access a single column
print(df['Name'])

#Access Multiple Columns
print(df[['Name', 'Age']])

#Access rows using index
print(df.loc[1])
print(df.iloc[2])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
Name       Bob
Age         30
City    Mumbai
Name: 1, dtype: object
Name    Charlie
Age          35
City      Delhi
Name: 2, dtype: object

In [27]:
# b) Adding a new column
df['Salary'] = [40000, 50000, 60000, 70000]
print(df)

      Name  Age       City  Salary
0    Alice   25  Hyderabad   40000
1      Bob   30     Mumbai   50000
2  Charlie   35      Delhi   60000
3    David   40  Bangalore   70000

In [28]:
# c) Removing a Column
df = df.drop('City', axis = 1)
print(df)

      Name  Age  Salary
0    Alice   25   40000
1      Bob   30   50000
2  Charlie   35   60000
3    David   40   70000

In [29]:
# d) Filtering Data
#select rows where age>30
print(df[df['Age'] > 30])

      Name  Age  Salary
2  Charlie   35   60000
3    David   40   70000

In [30]:
# e) Basic Statistics
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

32.5
40
25

In [32]:
#Create a DataFrame with student details
student_data = {
    'StudentID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Marks': [85, 92, 78, 90],
    'Department': ['CSE', 'ECE', 'ME', 'CSE']
}
df = pd.DataFrame(student_data)

#Display the DataFrame
print("Original DataFrame:")
print(df)

Original DataFrame:
   StudentID     Name  Marks Department
0        101    Alice     85        CSE
1        102      Bob     92        ECE
2        103  Charlie     78         ME
3        104    David     90        CSE

In [36]:
import pandas as pd

# 1. Define the dictionary with only the existing data.
student_data = {
    'sName': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'sRollNo': [101, 102, 103, 104, 105],
    'M1' : [70, 85, 78, 90, 35],
    'M2' : [75, 80, 88, 92, 40],
    'M3' : [99, 35, 85, 80, 80],
}

# 2. Create the DataFrame. This will now work without error.
df = pd.DataFrame(student_data)

# 3. Now, create the new columns based on the data in the DataFrame.
df['Total'] = df[['M1', 'M2', 'M3']].sum(axis=1)
df['Result'] = df[['M1', 'M2', 'M3']].apply(lambda x: 'Pass' if all(m >= 40 for m in x) else 'Fail', axis=1)
df['Average'] = df['Total'] / 3

# Display the final DataFrame
print("Final DataFrame:")
print(df)

Final DataFrame:
     sName  sRollNo  M1  M2  M3  Total Result    Average
0    Alice      101  70  75  99    244   Pass  81.333333
1      Bob      102  85  80  35    200   Fail  66.666667
2  Charlie      103  78  88  85    251   Pass  83.666667
3    David      104  90  92  80    262   Pass  87.333333
4      Eva      105  35  40  80    155   Fail  51.666667